/*
Дополнительное задание по асимптотическому анализу.
Оценка сложности программ.

1. Поностальгирую чуть-чуть по старой работе.

Для вычисления волновых функций состояний примеси в полупроводнике нужно решить
трёхмерное уравнение Шрёдингера. Полупроводник сразу даёт нам 8 уравнений
вместо двух в пустом пространстве, но это число фиксированное, и на
асимптотическую оценку не влияет. В качестве N мы возьмём количество узлов
сетки в одном измерении.

Метод грубой силы - разложение гамильтониана по ортонормированному базису
(в 3D - N^3) и диагонализация матрицы (M^3, где M - размер матрицы).
То есть, получаем сложность O(N^9). Такую программу мы не пишем.

Применяем тяжёлую математику (теорию непрерывных групп) и упрощаем уравнения.
От этого размерность задачи снижается с 3D до 1D.
Метод грубой силы вместо матрицы размера M=8*N^3 требует всего M=3N.
Итого, сложность O(N^3). Это уже терпимо и, увы, неизбежно. Нет лёгкого пути
диагонализовать матрицу общего вида.

2. Поиск ключевых слов в тексте.
Это из недр Chromium, до того, как они решили заменить сложный и
интеллектуальный фильтр фишинга на мини LLM (своего рода метод грубой силы).

До этого было так: проходим весь текст и ищем слова в таблице.
Пусть N - размер текста, а M - размер словаря.
Проход текста - O(N). Поиск бинарный - O(log M).
Итого: O(N log M).
*/
